<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Core","backend":"fcbaab2a89db6e211d55adf68973b4b7b5c055fb12a0793d1aead034f11f469e","plan_job_ref":"Job Infrastructure as Code - Plan #10 at https://github.com/lancelot-prigent/toolbox/actions/runs/15931974164","plan_hash":"b06cf978c4167c6451d3714b5316bab2dbaee5f773382e1dff6e7a0e509ae76a","plan_text_format":"diff","version":"2.1.0","plan_out_hash":"a0ac2af4366100d2b2d4a9ac7433f727fe17a79605ab81e28dc9e30200395972"} -->
OpenTofu plan for __Core__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "toolbox"
+       sha        = (known after apply)
    }

  # github_branch_default.main will be created
+   resource "github_branch_default" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "toolbox"
    }

  # github_repository.this will be created
+   resource "github_repository" "this" {
+       allow_auto_merge            = true
+       allow_merge_commit          = false
+       allow_rebase_merge          = false
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archived                    = false
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "A monorepo template with NestJS, React, React Native, and more. Powered by Nx."
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "toolbox"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "nestjs",
+           "nx",
+           "react",
+           "tailwindcss",
+           "typescript",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
    }

  # github_repository_ruleset.default_branch will be created
+   resource "github_repository_ruleset" "default_branch" {
+       enforcement = "active"
+       etag        = (known after apply)
+       id          = (known after apply)
+       name        = "default_branch_ruleset"
+       node_id     = (known after apply)
+       repository  = "toolbox"
+       ruleset_id  = (known after apply)
+       target      = "branch"

+       conditions {
+           ref_name {
+               exclude = []
+               include = [
+                   "~DEFAULT_BRANCH",
                ]
            }
        }

+       rules {
+           deletion                      = true
+           non_fast_forward              = true
+           update_allows_fetch_and_merge = false
        }
    }

  # scaleway_iam_group.developers will be created
+   resource "scaleway_iam_group" "developers" {
+       created_at          = (known after apply)
+       external_membership = false
+       id                  = (known after apply)
+       name                = "developers"
+       organization_id     = (known after apply)
+       updated_at          = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Infrastructure as Code - Plan #10](https://github.com/lancelot-prigent/toolbox/actions/runs/15931974164)